---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingHotWaterLoopId
source: html/5271439e-4ff2-11ba-d5b8-9ec0e0621963.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingHotWaterLoopId Property

The water loop element id for the hot-water heating coil.

## Syntax (C#)
```csharp
public ElementId HeatingHotWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null